In [7]:
import numpy as np
import pandas as pd
df=pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.839374 -0.861618
1    a  two  0.843879  0.921966
2    b  one  2.036503 -0.961810
3    b  two  0.471992 -0.855655
4    a  one -0.669910  1.465539

In [8]:
#Seriesçš„groupby()
df['data1']

0    0.839374
1    0.843879
2    2.036503
3    0.471992
4   -0.669910
Name: data1, dtype: float64

In [9]:
df['key1']

0    a
1    a
2    b
3    b
4    a
Name: key1, dtype: object

In [10]:
df['data1'].groupby(df['key1']).sum()

key1
a    1.013343
b    2.508496
Name: data1, dtype: float64

In [11]:
df['data1'].groupby(df['key1']).mean()

key1
a    0.337781
b    1.254248
Name: data1, dtype: float64

In [13]:
df.groupby('key1')['data1'].sum()

key1
a    1.013343
b    2.508496
Name: data1, dtype: float64

In [14]:
df.groupby('key1')['data2'].sum()

key1
a    1.525887
b   -1.817466
Name: data2, dtype: float64

In [16]:
df.groupby('key1')[['data1','data2']].sum()

         data1     data2
key1
a     1.013343  1.525887
b     2.508496 -1.817466